
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка = Неопределено Тогда 
		Объект.Акитвность = Истина; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьХэшНаСервере()
	
	ИмяФайла = ПолучитьИмяВременногоФайла("mp3"); 
	ДД = Объект.Ссылка.Медиа.Получить(); 
	ДД.Записать(ИмяФайла); 
	Объект.Хэш = СДЧ_ЗвуковыеОповещенияСервер.ХэшФайла(ИмяФайла);
	УдалитьФайлы(ИмяФайла); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьХэш(Команда)
	
	ПересчитатьХэшНаСервере();
	Записать(); 
	
КонецПроцедуры
